[
    {
        "id": 0,
        "category": "抑郁",
        "sub_category": "重性抑郁障碍",
        "standard": "A、2周内，5个或以上症状，其中至少一项是心境抑郁或丧失兴趣/愉悦感。\n1、大部分时间心境抑郁，感到悲伤、无望、空虚。儿童和青少年心境易激惹。\n2、对活动的兴趣或乐趣明显减少。\n3、未节食情况下体重明显减轻或增加，食欲每天都减退或增加。\n4、睡眠过多\n5、精神运动性激越或迟滞\n6、疲劳、精力不足\n7、觉得自己毫无价值、过分内疚\n8、思考或注意力的减退\n9、反复出现死亡想法、自杀观念、企图、特定计划\nB、有临床意义的痛苦，社交、学业等重要功能受损。\nC、不能归因为物质原因或其他躯体疾病。\nD、不能用精神分裂症谱系及其他精神病性障碍来解释\nE、从无躁狂发作和轻躁狂发作。",
        "situation": "小B同学是某大学大二学生，性格内向，平时话不多。刚入学时，他还能勉强适应大学生活，但随着时间推移，学业压力和人际关系的复杂让他逐渐感到力不从心。小B的成绩一直中规中矩，但最近一个学期，他的成绩开始下滑，甚至有几门课程接近挂科。他觉得自己很笨，无法像其他同学那样轻松应对学业，这种挫败感让他对学习失去了兴趣。小B的宿舍生活也不顺利。他常常感到被室友们忽视，尽管大家没有明显的冲突，但他内心总觉得无法融入这个小集体。最近几个月，小B的睡眠质量变得很差，经常失眠，白天则感到极度疲惫，甚至无法集中精力完成作业。他开始逃避社交活动，连每周一次的班级篮球赛也放弃了，而这是他曾经最期待的活动。更令人担忧的是，小B在日记中写下了许多消极的文字，表达了对生活的厌倦和对未来的迷茫。他觉得自己“一无是处”，甚至在一次深夜的电话中，向好友透露“不知道自己还能坚持多久”。好友虽然感到不安，但也没有太在意，认为这只是小B的一时情绪。"
    },
    {
        "id": 1,
        "category": "抑郁",
        "sub_category": "持续性抑郁障碍",
        "standard": "A.至少2年，出现抑郁心境；儿童和青少年表现为易激惹，且持续至少1年。\nB.抑郁状态时，有下列2项或更多症状存在：\n1.食欲不振或过多进食。\n2.失眠或睡眠过多。\n3.缺乏精力或疲劳。\n4.自尊心低。\n5.注意力不集中或犹豫不决。\n6.感到无望。\nC.在2年的病程中（儿童和青少年为1年），个体从未有2个月以上没有诊断标准A和B的症状。\nD.重性抑郁障碍的诊断标准可以连续存在2年。\nE.从未出现过躁狂或轻躁狂发作，且从不符合环性心境障碍的诊断标准。\nF.不能用精神分裂症谱系及其他精神病性障碍来更好地解释。\nG.不能归因于某种物质的生理效应，或其他躯体疾病。\nH.引起有临床意义的痛苦，或导致社交、职业或其他重要功能方面的损害。\n",
        "situation": "小C是一名大四学生，刚上大学时，他也对校园生活满怀期待，可随着课程难度提升，学业上力不从心。考试成绩不理想，课堂上难以集中注意力，逐渐认为自己是失败者。\n进入大四，毕业压力和求职压力接踵而至，周围同学积极寻找机会，小C却对课题组内的实验感到力不从心，更没有勇气出去寻找工作机会，他害怕面对竞争和压力，觉得自己毫无优势，会一直失败，因此每日萎靡，毫无行动动力。\n在同学眼中，小C是个孤僻的人。宿舍里，大家围坐聊天时，他总是独自坐在角落，默默无言，小组作业时，他也很少主动交流想法，久而久之，同学们与他的交集越来越少。“小C好像总是心事重重，不太愿意和大家打交道。”一位同学曾这样评价。老师们对小C也有类似的印象，课堂上，他眼神游离，时常发呆，作业质量不高而且多次缺交，任课老师曾数次找他谈话，可小C总是低着头，回应简短。\n日常生活中，小C被低落情绪长期笼罩，不注重个人卫生。学业上，绩点低，多门课程不及格，虽知道情况不妙，却缺乏改变动力。"
    },
    {
        "id": 2,
        "category": "焦虑",
        "sub_category": "广泛性焦虑",
        "standard": "A. 至少6个月，对于诸多事件或活动表现出过分的焦虑和担心。\nB. 难以控制这种担心。\nC. 这种焦虑和担心与下列6种症状中至少3种有关：\n1. 坐立不安、感觉到激动或紧张。\n2. 容易疲惫。\n3. 注意力难以集中或头脑一片空白。\n4. 易激惹。\n5. 肌肉紧张。\n6. 睡眠障碍（难以入睡或保持睡眠状态，或休息不充分的、质量不满意的睡眠）。\nD. 引起临床意义的痛苦，或导致社交、职业或其他重要功能方面的损害。\nE. 这种障碍不能归因于某种物质的生理效应，或其他躯体疾病。\nF. 这种障碍不能用其他精神障碍来更好地解释。",
        "situation": "小D是一名大三计算机科学专业学生。高中时，她成绩优异，在学科竞赛中多次获奖。然而进入大学，课程难度提升、竞争激烈，加上对未来职业的迷茫，她逐渐陷入焦虑。近半年，小D的焦虑症状愈发明显。她每天过度担忧课程作业、考试成绩、实习机会等，且难以自控。课堂上，她坐立不安，双腿不自觉抖动，双手摆弄文具，无法专注听讲。她常心慌、呼吸急促，尤其在考试或项目截止日期时症状加剧。一次课堂上，她突然头晕目眩，差点晕倒，老师和同学以为她身体不适，她自己清楚是焦虑所致。小D在日常学习中难以集中注意力，面对电脑代码，大脑一片空白，学习效率大幅下降，因此频繁以“身体不舒服”为由向老师请假，实际上是看到代码就心生恐慌。社交生活中，小D也深受影响。她曾是学生会骨干，积极参与社团活动。但近几个月，她开始逃避社团活动，拒绝参加班级聚会。室友询问，她总是说“没事，只是有点累”。回宿舍后，她常独自发呆，肌肉因紧张而僵硬，夜晚，小D饱受睡眠障碍困扰，难以入睡。"
    },
    {
        "id": 3,
        "category": "焦虑",
        "sub_category": "社交焦虑",
        "standard": "A. 面对可能被他人审视的社交情况时而产生显著的害怕或焦虑。例如，社交互动，被观看（吃、喝的时候），以及在他人面前演讲时。\n B. 个体害怕自己的言行或呈现的焦虑症状会导致负性的评价（即被羞辱或尴尬，导致被拒绝或冒犯他人）。\n C. 社交情况几乎总是能够促发害怕或焦虑。\n D. 主动回避社交情况，或是带着强烈的害怕或焦虑去忍受。\n E. 这种害怕或焦虑与社交情况和社会文化环境所造成的实际威胁不相称。\n F. 这种害怕、焦虑或回避通常持续至少6个月。\n G. 这种害怕、焦虑或回避引起有临床意义的痛苦，或导致社交、职业或其他重要功能方面的损害。\n H. 这种害怕、焦虑或回避不能归因于某种物质的生理效应，或其他躯体疾病。\n I. 这种害怕、焦虑或回避不能用其他精神障碍来更好地解释。\n J. 如果存在其他躯体疾病（例如，帕金森氏病、肥胖症、烧伤或外伤造成的畸形）存在，这种害怕、焦虑或回避则是明确与其不相关或是过度。\n",
        "situation": "小F是一名大三学生，他从小一直很安静内向，但最近身边人察觉到他有一些不对劲。\n在课堂上他从不主动回答老师提出的问题，小组讨论时，他也总是窝在角落。同学眼中，小F总是沉默寡言，很少主动参与讨论，以为他性格孤僻。老师留意到小F的异样，多次鼓励他发言，可每次得到的，都是小F慌张躲闪的眼神。\n校园里，小F与同学迎面相逢，他会迅速低下头，装作没看见，匆匆擦肩而过。同学觉得他冷漠，殊不知简单的寒暄，对小F来说都是难以跨越的障碍。\n学习上，小F就算有疑问也不敢向老师和同学请教，只能独自摸索，学习效率大打折扣。小组作业时，因不敢与组员沟通，他的能力被埋没，成绩也受影响。老师疑惑于他的表现，明明有实力，却总是在团队协作中“隐身”。\n实习阶段，小F的焦虑达到顶峰，面试时，面对面试官，他声音颤抖、结结巴巴，准备好的内容忘得精光。实习工作中，同事分配任务，他不敢多问，自己瞎琢磨，事倍功半，同事们不理解他为何如此“不合群”，沟通如此困难。"
    },
    {
        "id": 4,
        "category": "双相障碍",
        "sub_category": "",
        "standard": "",
        "situation": "小D同学是一名大二学生，性格开朗且多才多艺。刚入学时，他迅速融入了大学生活，加入了多个社团，还担任了班级文艺委员。他总是充满活力，是班级活动的“灵魂人物”。然而，进入大二后，他的情绪开始出现明显的波动。\n有时，小D会连续几天处于极度兴奋的状态。他会整夜不睡，却依然精力充沛，滔滔不绝地和同学们分享各种想法，甚至会同时参与多个项目，觉得自己“无所不能”。但这种兴奋状态并不会持续太久，很快他就会陷入低落的情绪中。在低落时，小D会变得沉默寡言，对任何事情都提不起兴趣，甚至会无缘无故地哭泣。他觉得自己“一无是处”，对未来的学业和生活感到绝望。\n最近一次，小D在班级组织的文艺汇演中，因为一次小失误而突然情绪失控，当场大哭起来。同学们都很惊讶，因为这与他平时的表现完全不符。之后，他开始逃避班级活动，甚至拒绝与室友交流。辅导员注意到他的异常后，多次尝试与他沟通，但小D总是回避，甚至表示“自己也不知道怎么了”。"
    },
    {
        "id": 5,
        "category": "双相障碍",
        "sub_category": "双相情感障碍I型",
        "standard": "A.至少一次符合躁狂发作的诊断标准。\nB.这种躁狂和重性抑郁发作的出现不能更好地用分裂情感性障碍、精神分裂症、精神分裂样障碍、妄想障碍、其他特定的或未特定的精神分裂症谱系及其他精神病性障碍来解释。",
        "situation": "小Y是一名大三学生，性格外向且社交能力强。入学以来，他一直是班级里的活跃分子，积极参与各种社团活动，并且在学业上也表现出色。然而，进入大三后，小Y的情绪开始出现剧烈波动。有时，他会连续数天处于极度兴奋的状态，感觉精力充沛，思维奔逸，甚至觉得自己可以同时处理多个项目。在这种状态下，他几乎不需要睡眠，也不觉得疲劳。但这种兴奋状态通常不会持续太久，紧接着他会陷入深度的抑郁状态，变得沉默寡言，对任何事情都失去兴趣，甚至会感到极度的自我否定和绝望。他觉得自己“一无是处”，对未来的学业和生活感到无助。最近，小Y在一次小组讨论中突然情绪失控，大声打断他人并指责自己“什么都做不好”，这让同学们感到非常惊讶。辅导员注意到他的异常后，尝试与他沟通，但他总是回避，甚至表示“自己也不知道怎么了”。"
    },
    {
        "id": 6,
        "category": "双相障碍",
        "sub_category": "双相情感障碍II型",
        "standard": "A.至少一次符合轻躁狂发作（上述符合轻躁狂发作A—F的诊断标准）和至少一次符合重性抑郁发作（上述符合重性抑郁发作A—C的诊断标准）的诊断标准。\nB.从未有过躁狂发作。\nC.这种轻躁狂和重性抑郁发作的出现不能更好地用分裂情感性障碍、精神分裂症、精神分裂样障碍、妄想障碍、其他特定的或未特定的精神分裂症谱系及其他精神病性障碍来解释。\nD.抑郁症状或抑郁期和轻躁狂期的频繁交替所致的不可预测性，引起有临床意义的痛苦，或导致社交、职业或其他重要功能的损害。",
        "situation": "小H是一名大三学生，性格内向，学习成绩一直很优秀。然而，从大二开始，她的状态变得不稳定。她经常感到情绪低落，对学习和生活失去兴趣，甚至出现了失眠和食欲不振的情况。但与典型的抑郁症不同，她每隔一段时间会突然变得非常兴奋，这种兴奋状态虽然不会非常剧烈，但仍然影响了她的正常生活。在兴奋期，她会过度计划学习任务，甚至会熬夜学习，但很快又会陷入低落情绪，无法集中注意力。辅导员注意到她的异常后，尝试与她沟通，但她总是回避话题。"
    }
]